; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-3-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-11 - location
	p1-6 - location
	p1-8 - location
	p1-12 - location
	p2-5 - location
	p2-7 - location
	p3-1 - location
	p3-5 - location
	p4-2 - location
	p4-7 - location
	p4-8 - location
	p4-11 - location
	p5-4 - location
	p5-10 - location
	p6-3 - location
	p6-7 - location
	p7-3 - location
	p8-5 - location
	p9-7 - location
	p10-0 - location
	p11-8 - location
	p12-9 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s12)
	(at driver3 s8)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at package1 s10)
	(at package2 s2)
	(at package3 s6)
	(at package4 s4)
	(at package5 s8)
	(at package6 s9)
	(at package7 s11)
	(at package8 s8)
	(at package9 s6)
	(at package10 s12)
	(path s0 p0-11)
	(path p0-11 s0)
	(path s11 p0-11)
	(path p0-11 s11)
	(= (time-to-walk s0 p0-11) 59)
	(= (time-to-walk p0-11 s0) 59)
	(= (time-to-walk s11 p0-11) 95)
	(= (time-to-walk p0-11 s11) 95)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 91)
	(= (time-to-walk p1-6 s1) 91)
	(= (time-to-walk s6 p1-6) 48)
	(= (time-to-walk p1-6 s6) 48)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(= (time-to-walk s1 p1-8) 13)
	(= (time-to-walk p1-8 s1) 13)
	(= (time-to-walk s8 p1-8) 69)
	(= (time-to-walk p1-8 s8) 69)
	(path s1 p1-12)
	(path p1-12 s1)
	(path s12 p1-12)
	(path p1-12 s12)
	(= (time-to-walk s1 p1-12) 63)
	(= (time-to-walk p1-12 s1) 63)
	(= (time-to-walk s12 p1-12) 62)
	(= (time-to-walk p1-12 s12) 62)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 16)
	(= (time-to-walk p2-5 s2) 16)
	(= (time-to-walk s5 p2-5) 25)
	(= (time-to-walk p2-5 s5) 25)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(= (time-to-walk s2 p2-7) 99)
	(= (time-to-walk p2-7 s2) 99)
	(= (time-to-walk s7 p2-7) 62)
	(= (time-to-walk p2-7 s7) 62)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 11)
	(= (time-to-walk p3-1 s3) 11)
	(= (time-to-walk s1 p3-1) 66)
	(= (time-to-walk p3-1 s1) 66)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 77)
	(= (time-to-walk p3-5 s3) 77)
	(= (time-to-walk s5 p3-5) 76)
	(= (time-to-walk p3-5 s5) 76)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 39)
	(= (time-to-walk p4-2 s4) 39)
	(= (time-to-walk s2 p4-2) 91)
	(= (time-to-walk p4-2 s2) 91)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 81)
	(= (time-to-walk p4-7 s4) 81)
	(= (time-to-walk s7 p4-7) 30)
	(= (time-to-walk p4-7 s7) 30)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(= (time-to-walk s4 p4-8) 68)
	(= (time-to-walk p4-8 s4) 68)
	(= (time-to-walk s8 p4-8) 78)
	(= (time-to-walk p4-8 s8) 78)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(= (time-to-walk s4 p4-11) 94)
	(= (time-to-walk p4-11 s4) 94)
	(= (time-to-walk s11 p4-11) 48)
	(= (time-to-walk p4-11 s11) 48)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 46)
	(= (time-to-walk p5-4 s5) 46)
	(= (time-to-walk s4 p5-4) 44)
	(= (time-to-walk p5-4 s4) 44)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(= (time-to-walk s5 p5-10) 36)
	(= (time-to-walk p5-10 s5) 36)
	(= (time-to-walk s10 p5-10) 30)
	(= (time-to-walk p5-10 s10) 30)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(= (time-to-walk s6 p6-3) 37)
	(= (time-to-walk p6-3 s6) 37)
	(= (time-to-walk s3 p6-3) 48)
	(= (time-to-walk p6-3 s3) 48)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 42)
	(= (time-to-walk p6-7 s6) 42)
	(= (time-to-walk s7 p6-7) 95)
	(= (time-to-walk p6-7 s7) 95)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(= (time-to-walk s7 p7-3) 42)
	(= (time-to-walk p7-3 s7) 42)
	(= (time-to-walk s3 p7-3) 33)
	(= (time-to-walk p7-3 s3) 33)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(= (time-to-walk s8 p8-5) 43)
	(= (time-to-walk p8-5 s8) 43)
	(= (time-to-walk s5 p8-5) 54)
	(= (time-to-walk p8-5 s5) 54)
	(path s9 p9-7)
	(path p9-7 s9)
	(path s7 p9-7)
	(path p9-7 s7)
	(= (time-to-walk s9 p9-7) 1)
	(= (time-to-walk p9-7 s9) 1)
	(= (time-to-walk s7 p9-7) 5)
	(= (time-to-walk p9-7 s7) 5)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(= (time-to-walk s10 p10-0) 15)
	(= (time-to-walk p10-0 s10) 15)
	(= (time-to-walk s0 p10-0) 16)
	(= (time-to-walk p10-0 s0) 16)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(= (time-to-walk s11 p11-8) 30)
	(= (time-to-walk p11-8 s11) 30)
	(= (time-to-walk s8 p11-8) 14)
	(= (time-to-walk p11-8 s8) 14)
	(path s12 p12-9)
	(path p12-9 s12)
	(path s9 p12-9)
	(path p12-9 s9)
	(= (time-to-walk s12 p12-9) 77)
	(= (time-to-walk p12-9 s12) 77)
	(= (time-to-walk s9 p12-9) 40)
	(= (time-to-walk p12-9 s9) 40)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 79)
	(= (time-to-drive s2 s0) 79)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 53)
	(= (time-to-drive s7 s0) 53)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 16)
	(= (time-to-drive s12 s0) 16)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 17)
	(= (time-to-drive s0 s1) 17)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 44)
	(= (time-to-drive s4 s1) 44)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 96)
	(= (time-to-drive s6 s1) 96)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 47)
	(= (time-to-drive s1 s2) 47)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 11)
	(= (time-to-drive s6 s2) 11)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 73)
	(= (time-to-drive s9 s2) 73)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 41)
	(= (time-to-drive s10 s2) 41)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 59)
	(= (time-to-drive s11 s2) 59)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 19)
	(= (time-to-drive s1 s3) 19)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 84)
	(= (time-to-drive s2 s3) 84)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 94)
	(= (time-to-drive s4 s3) 94)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 48)
	(= (time-to-drive s7 s3) 48)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 20)
	(= (time-to-drive s8 s3) 20)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 41)
	(= (time-to-drive s9 s3) 41)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 90)
	(= (time-to-drive s11 s4) 90)
	(link s4 s12)
	(link s12 s4)
	(= (time-to-drive s4 s12) 15)
	(= (time-to-drive s12 s4) 15)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 82)
	(= (time-to-drive s4 s5) 82)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 22)
	(= (time-to-drive s7 s5) 22)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 57)
	(= (time-to-drive s9 s5) 57)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 36)
	(= (time-to-drive s10 s5) 36)
	(link s5 s11)
	(link s11 s5)
	(= (time-to-drive s5 s11) 22)
	(= (time-to-drive s11 s5) 22)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 62)
	(= (time-to-drive s0 s6) 62)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 51)
	(= (time-to-drive s7 s6) 51)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 37)
	(= (time-to-drive s1 s7) 37)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 91)
	(= (time-to-drive s9 s7) 91)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 64)
	(= (time-to-drive s10 s7) 64)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 14)
	(= (time-to-drive s5 s8) 14)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 31)
	(= (time-to-drive s6 s8) 31)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 42)
	(= (time-to-drive s7 s8) 42)
	(link s9 s6)
	(link s6 s9)
	(= (time-to-drive s9 s6) 67)
	(= (time-to-drive s6 s9) 67)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 46)
	(= (time-to-drive s8 s9) 46)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 59)
	(= (time-to-drive s0 s10) 59)
	(link s11 s12)
	(link s12 s11)
	(= (time-to-drive s11 s12) 10)
	(= (time-to-drive s12 s11) 10)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver3 s12)
	(at truck1 s9)
	(at truck2 s1)
	(at truck3 s3)
	(at package1 s10)
	(at package2 s10)
	(at package3 s6)
	(at package4 s6)
	(at package5 s1)
	(at package7 s10)
	(at package8 s10)
	(at package9 s11)
	(at package10 s1)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver2 s12 p1-12)
   deleted: (at driver2 s12)
   added: (at driver2 p1-12)
   changed: (walked) from 0 to 62
   goals met: 3 of 13
2. (walk driver3 s8 p11-8)
   deleted: (at driver3 s8)
   added: (at driver3 p11-8)
   changed: (walked) from 62 to 76
   goals met: 3 of 13
3. (walk driver3 p11-8 s11)
   deleted: (at driver3 p11-8)
   added: (at driver3 s11)
   changed: (walked) from 76 to 106
   goals met: 3 of 13
4. (walk driver3 s11 p0-11)
   deleted: (at driver3 s11)
   added: (at driver3 p0-11)
   changed: (walked) from 106 to 201
   goals met: 3 of 13
5. (walk driver3 p0-11 s0)
   deleted: (at driver3 p0-11)
   added: (at driver3 s0)
   changed: (walked) from 201 to 260
   goals met: 3 of 13
6. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 3 of 13
7. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 0 to 79
   goals met: 3 of 13
8. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 3 of 13
9. (drive-truck truck1 s2 s6 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 79 to 90
   goals met: 3 of 13
10. (load-truck package9 truck1 s6)
   deleted: (at package9 s6)
   added: (in package9 truck1)
   goals met: 3 of 13
11. (drive-truck truck1 s6 s2 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 90 to 101
   goals met: 3 of 13
12. (drive-truck truck1 s2 s10 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s10)
   changed: (driven) from 101 to 142
   goals met: 3 of 13
13. (unload-truck package2 truck1 s10)
   deleted: (in package2 truck1)
   added: (at package2 s10)
   goals met: 4 of 13
14. (drive-truck truck1 s10 s0 driver3)
   deleted: (at truck1 s10)
   added: (at truck1 s0)
   changed: (driven) from 142 to 201
   goals met: 4 of 13
15. (drive-truck truck1 s0 s12 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s12)
   changed: (driven) from 201 to 217
   goals met: 4 of 13
16. (load-truck package10 truck1 s12)
   deleted: (at package10 s12)
   added: (in package10 truck1)
   goals met: 4 of 13
17. (drive-truck truck1 s12 s0 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s0)
   changed: (driven) from 217 to 233
   goals met: 4 of 13
18. (drive-truck truck1 s0 s6 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (driven) from 233 to 295
   goals met: 4 of 13
19. (drive-truck truck1 s6 s8 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   changed: (driven) from 295 to 326
   goals met: 4 of 13
20. (load-truck package5 truck1 s8)
   deleted: (at package5 s8)
   added: (in package5 truck1)
   goals met: 4 of 13
21. (drive-truck truck1 s8 s6 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s6)
   changed: (driven) from 326 to 357
   goals met: 4 of 13
22. (drive-truck truck1 s6 s1 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (driven) from 357 to 453
   goals met: 4 of 13
23. (unload-truck package10 truck1 s1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 5 of 13
24. (drive-truck truck1 s1 s4 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (driven) from 453 to 497
   goals met: 5 of 13
25. (load-truck package4 truck1 s4)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 5 of 13
26. (drive-truck truck1 s4 s1 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (driven) from 497 to 541
   goals met: 5 of 13
27. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   goals met: 6 of 13
28. (drive-truck truck1 s1 s6 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (driven) from 541 to 637
   goals met: 6 of 13
29. (unload-truck package4 truck1 s6)
   deleted: (in package4 truck1)
   added: (at package4 s6)
   goals met: 7 of 13
30. (drive-truck truck1 s6 s0 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   changed: (driven) from 637 to 699
   goals met: 7 of 13
31. (drive-truck truck1 s0 s12 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s12)
   changed: (driven) from 699 to 715
   goals met: 7 of 13
32. (drive-truck truck1 s12 s4 driver3)
   deleted: (at truck1 s12)
   added: (at truck1 s4)
   changed: (driven) from 715 to 730
   goals met: 7 of 13
33. (walk driver2 p1-12 s12)
   deleted: (at driver2 p1-12)
   added: (at driver2 s12)
   changed: (walked) from 260 to 322
   goals met: 7 of 13
34. (drive-truck truck1 s4 s11 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s11)
   changed: (driven) from 730 to 820
   goals met: 7 of 13
35. (load-truck package7 truck1 s11)
   deleted: (at package7 s11)
   added: (in package7 truck1)
   goals met: 7 of 13
36. (unload-truck package9 truck1 s11)
   deleted: (in package9 truck1)
   added: (at package9 s11)
   goals met: 8 of 13
37. (drive-truck truck1 s11 s12 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s12)
   changed: (driven) from 820 to 830
   goals met: 8 of 13
38. (disembark-truck driver3 truck1 s12)
   deleted: (driving driver3 truck1)
   added: (at driver3 s12) (empty truck1)
   goals met: 9 of 13
39. (board-truck driver2 truck1 s12)
   deleted: (at driver2 s12) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 9 of 13
40. (drive-truck truck1 s12 s0 driver2)
   deleted: (at truck1 s12)
   added: (at truck1 s0)
   changed: (driven) from 830 to 846
   goals met: 9 of 13
41. (drive-truck truck1 s0 s10 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s10)
   changed: (driven) from 846 to 905
   goals met: 9 of 13
42. (unload-truck package7 truck1 s10)
   deleted: (in package7 truck1)
   added: (at package7 s10)
   goals met: 10 of 13
43. (drive-truck truck1 s10 s0 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s0)
   changed: (driven) from 905 to 964
   goals met: 10 of 13
44. (drive-truck truck1 s0 s6 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (driven) from 964 to 1026
   goals met: 10 of 13
45. (drive-truck truck1 s6 s8 driver2)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   changed: (driven) from 1026 to 1057
   goals met: 10 of 13
46. (load-truck package8 truck1 s8)
   deleted: (at package8 s8)
   added: (in package8 truck1)
   goals met: 10 of 13
47. (drive-truck truck1 s8 s5 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   changed: (driven) from 1057 to 1071
   goals met: 10 of 13
48. (drive-truck truck1 s5 s10 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s10)
   changed: (driven) from 1071 to 1107
   goals met: 10 of 13
49. (unload-truck package8 truck1 s10)
   deleted: (in package8 truck1)
   added: (at package8 s10)
   goals met: 11 of 13
50. (drive-truck truck1 s10 s5 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s5)
   changed: (driven) from 1107 to 1143
   goals met: 11 of 13
51. (drive-truck truck1 s5 s8 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   changed: (driven) from 1143 to 1157
   goals met: 11 of 13
52. (disembark-truck driver2 truck1 s8)
   deleted: (driving driver2 truck1)
   added: (at driver2 s8) (empty truck1)
   goals met: 11 of 13
53. (walk driver3 s12 p12-9)
   deleted: (at driver3 s12)
   added: (at driver3 p12-9)
   changed: (walked) from 322 to 399
   goals met: 10 of 13
54. (board-truck driver1 truck1 s8)
   deleted: (at driver1 s8) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 10 of 13
55. (drive-truck truck1 s8 s9 driver1)
   deleted: (at truck1 s8)
   added: (at truck1 s9)
   changed: (driven) from 1157 to 1203
   goals met: 11 of 13
56. (disembark-truck driver1 truck1 s9)
   deleted: (driving driver1 truck1)
   added: (at driver1 s9) (empty truck1)
   goals met: 11 of 13
57. (walk driver3 p12-9 s12)
   deleted: (at driver3 p12-9)
   added: (at driver3 s12)
   changed: (walked) from 399 to 476
   goals met: 12 of 13
58. (walk driver2 s8 p11-8)
   deleted: (at driver2 s8)
   added: (at driver2 p11-8)
   changed: (walked) from 476 to 490
   goals met: 12 of 13
59. (walk driver2 p11-8 s11)
   deleted: (at driver2 p11-8)
   added: (at driver2 s11)
   changed: (walked) from 490 to 520
   goals met: 12 of 13
60. (walk driver2 s11 p0-11)
   deleted: (at driver2 s11)
   added: (at driver2 p0-11)
   changed: (walked) from 520 to 615
   goals met: 12 of 13
61. (walk driver2 p0-11 s0)
   deleted: (at driver2 p0-11)
   added: (at driver2 s0)
   changed: (walked) from 615 to 674
   goals met: 12 of 13
62. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 12 of 13
63. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 1203 to 1220
   goals met: 13 of 13
